Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.Instance Field
 The instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static readonly DrawingHandler Instance
Public Shared ReadOnly Instance As DrawingHandler
Field Value
Type: DrawingHandler
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace